## IEEE Day GLA University Mathura Chapter

In [1]:
# Importing the library
import pandas as pd

In [2]:
data = {'System_No':[i for i in range(1, 9)], 
        'Name':['Rishabh Vats', 'Ritu Rai', 'Shikha Pathak', 
                'Anant Sain', 'Jyoti Chaudhary', 'Sanjana Soni', 
                'Bilal Sikander', 'Shubham Roy']}

### Converting to DataFrame

In [3]:
data = pd.DataFrame(data)

data = data.set_index('System_No')

### Checking out the initial state of data

In [4]:
data

                      Name
System_No
1             Rishabh Vats
2                 Ritu Rai
3            Shikha Pathak
4               Anant Sain
5          Jyoti Chaudhary
6             Sanjana Soni
7           Bilal Sikander
8              Shubham Roy

### Adding Scores of Event #1 - *`Writing the HTML Code`*

**Note:** Scores are assigned on a scale of 5 and are evaluated on the basis of code quality and the output generated

In [5]:
data['Event1'] = [1, 2, 0, 0, 0, 4, 4, 3]

### Adding Scores of Event #2 - *`Typing the Paragraph with a Twist`*

**Note:** Scores are assigned on a scale of 20 and are evaluated on the basis of correctly typed words.

In [6]:
data['Event2'] = [10, 12, 17, 12, 13, 17, 5, 15]

### Adding Scores of Event #3 - *`Identify the Logo(Associated in Research)`*

**Note:** Scores are assigned on a scale of 20 and are evaluated on the basis of correctly typed words.

In [7]:
data['Event3'] = [7, 9, 7, 8, 5, 8, 10, 11]

### Adding Scores of Event #4 - *`Outputs that can make you crazy in C`*

**Note:** Scores are assigned on a scale of 10.

In [8]:
data['Event4'] = [2, 2, 3, 2, 1, 8, 4, 5]

## The scores are added into the data, let's check it.

In [9]:
data

                      Name  Event1  Event2  Event3  Event4
System_No
1             Rishabh Vats       1      10       7       2
2                 Ritu Rai       2      12       9       2
3            Shikha Pathak       0      17       7       3
4               Anant Sain       0      12       8       2
5          Jyoti Chaudhary       0      13       5       1
6             Sanjana Soni       4      17       8       8
7           Bilal Sikander       4       5      10       4
8              Shubham Roy       3      15      11       5

#### I personally want to appreciate all the students for their enthusiasm and Thanks for your time.
#### `Keep learning, keep exploring. Stay away from the negatives.`

### Wait! I am not finished yet. Time to set the leaderboard.

In [10]:
data['Event1_Rank'] = data['Event1'].rank(ascending=0, method='dense').astype('int')
data['Event2_Rank'] = data['Event2'].rank(ascending=0, method='dense').astype('int')
data['Event3_Rank'] = data['Event3'].rank(ascending=0, method='dense').astype('int')
data['Event4_Rank'] = data['Event4'].rank(ascending=0, method='dense').astype('int')

### Fingers crossed!!! Here it comes the leaderboard.

In [11]:
data

,Name,Event1,Event2,Event3,Event4,Event1_Rank,Event2_Rank,Event3_Rank,Event4_Rank
System_No,,,,,,,,,
1,Rishabh Vats,1,10,7,2,4,5,5,5
2,Ritu Rai,2,12,9,2,3,4,3,5
3,Shikha Pathak,0,17,7,3,5,1,5,4
4,Anant Sain,0,12,8,2,5,4,4,5
5,Jyoti Chaudhary,0,13,5,1,5,3,6,6
6,Sanjana Soni,4,17,8,8,1,1,4,1
7,Bilal Sikander,4,5,10,4,1,6,2,3
8,Shubham Roy,3,15,11,5,2,2,1,2

## Leaderboard

### Event #1

In [12]:
data.sort_values(by=['Event1_Rank'])[['Name', 'Event1_Rank']]

                      Name  Event1_Rank
System_No
6             Sanjana Soni            1
7           Bilal Sikander            1
8              Shubham Roy            2
2                 Ritu Rai            3
1             Rishabh Vats            4
3            Shikha Pathak            5
4               Anant Sain            5
5          Jyoti Chaudhary            5

### Event #2

In [13]:
data.sort_values(by=['Event2_Rank'])[['Name', 'Event2_Rank']]

                      Name  Event2_Rank
System_No
3            Shikha Pathak            1
6             Sanjana Soni            1
8              Shubham Roy            2
5          Jyoti Chaudhary            3
2                 Ritu Rai            4
4               Anant Sain            4
1             Rishabh Vats            5
7           Bilal Sikander            6

### Event #3

In [14]:
data.sort_values(by=['Event3_Rank'])[['Name', 'Event3_Rank']]

                      Name  Event3_Rank
System_No
8              Shubham Roy            1
7           Bilal Sikander            2
2                 Ritu Rai            3
4               Anant Sain            4
6             Sanjana Soni            4
1             Rishabh Vats            5
3            Shikha Pathak            5
5          Jyoti Chaudhary            6

### Event #4

In [15]:
data.sort_values(by=['Event4_Rank'])[['Name', 'Event4_Rank']]

                      Name  Event4_Rank
System_No
6             Sanjana Soni            1
8              Shubham Roy            2
7           Bilal Sikander            3
3            Shikha Pathak            4
1             Rishabh Vats            5
2                 Ritu Rai            5
4               Anant Sain            5
5          Jyoti Chaudhary            6

### With Regards - Sanket Sharma, M.Tech Final Year CSE Specializing in Information Retrieval